<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
body {
	background-color: #663333;
}
body,td,th {
	color: #CCCCCC;
	font-size: 18px;
}
-->
</style></head>

<body>
<h3 align="center"><br />
  &iquest;Qu&eacute; son los discos duros?</h3>
<p>Los discos duros son dispositivos de almacenamiento electromec&aacute;nicos utilizados en computadoras y otros dispositivos electr&oacute;nicos para almacenar datos de forma permanente. Consisten en discos magn&eacute;ticos recubiertos de material sensible a la magnetizaci&oacute;n y un brazo mec&aacute;nico que lee y escribe datos en estos discos.</p>
<p>&nbsp;</p>
<p align="center"><img src="59e562c2-fcf2-4b5e-862c-9f0cf0e18e1c_200_200.gif" width="249" height="238" /></p>
<p>&nbsp;</p>
<h3 align="center">Funcionamiento</h3>
<ol>
  <li>
    <p><strong>Platos magn&eacute;ticos</strong>: Los discos duros consisten en varios platos magn&eacute;ticos apilados uno encima del otro. Estos platos est&aacute;n recubiertos con un material sensible a la magnetizaci&oacute;n.</p>
  </li>
  <li>
    <p><strong>Cabezales de lectura/escritura</strong>: Cada plato tiene un cabezal de lectura/escritura que flota sobre su superficie mediante un cojinete de aire generado por la rotaci&oacute;n del disco. Este cabezal es responsable de leer y escribir datos en la superficie del disco mediante cambios en la magnetizaci&oacute;n del material.</p>
  </li>
  <li>
    <p><strong>Brazo mec&aacute;nico</strong>: Los cabezales de lectura/escritura est&aacute;n montados en un brazo mec&aacute;nico que se mueve de forma r&aacute;pida y precisa sobre la superficie de los discos para acceder a la ubicaci&oacute;n deseada de los datos.</p>
  </li>
  <li>
    <p><strong>Motor de disco</strong>: Un motor de disco gira los platos a alta velocidad, generalmente entre 5,400 y 15,000 revoluciones por minuto (RPM), lo que permite un acceso r&aacute;pido a los datos almacenados.</p>
  </li>
</ol>
<h3 align="center">Caracter&iacute;sticas</h3>
<ol>
  <li>
    <p><strong>Capacidad</strong>: Los discos duros est&aacute;n disponibles en una amplia gama de capacidades, desde unos pocos gigabytes hasta varios terabytes o m&aacute;s, dependiendo del modelo.</p>
  </li>
  <li>
    <p><strong>Velocidad de rotaci&oacute;n</strong>: La velocidad de rotaci&oacute;n de un disco duro influye en su rendimiento. Los discos m&aacute;s r&aacute;pidos tienen tiempos de acceso m&aacute;s cortos y tasas de transferencia de datos m&aacute;s altas.</p>
  </li>
  <li>
    <p><strong>Interfaz</strong>: Los discos duros se conectan a la placa madre de la computadora a trav&eacute;s de diferentes interfaces, como SATA, SAS o PCIe.</p>
  </li>
  <li>
    <p><strong>Formato f&iacute;sico</strong>: Los discos duros est&aacute;n disponibles en diferentes formatos f&iacute;sicos, como discos de 3.5 pulgadas para computadoras de escritorio y discos de 2.5 pulgadas para computadoras port&aacute;tiles.</p>
  </li>
</ol>
<p>&nbsp;</p>
<p align="center"><img src="41Q9.gif" width="580" height="307" /></p>
<p>&nbsp;</p>
<h3 align="center">Historia y Evoluci&oacute;n </h3>
<ol>
  <li>
    <p><strong>Primera Generaci&oacute;n (D&eacute;cada de 1950 - 1960)</strong>: Los primeros discos duros fueron desarrollados por IBM y almacenaban datos en discos magn&eacute;ticos recubiertos de &oacute;xido de hierro. Ten&iacute;an capacidades muy limitadas, generalmente en el orden de varios megabytes.</p>
  </li>
  <li>
    <p><strong>Segunda Generaci&oacute;n (D&eacute;cada de 1970 - 1980)</strong>: Durante esta &eacute;poca, los discos duros se hicieron m&aacute;s comunes en las computadoras personales y se utilizaron para almacenar sistemas operativos y programas. Las capacidades aumentaron a varias decenas de megabytes.</p>
  </li>
  <li>
    <p><strong>Tercera Generaci&oacute;n (D&eacute;cada de 1990)</strong>: En esta &eacute;poca, los discos duros comenzaron a utilizarse en aplicaciones empresariales y servidores, lo que llev&oacute; a un aumento significativo en la capacidad y la velocidad de rotaci&oacute;n. Los discos duros IDE y SCSI se volvieron populares.</p>
  </li>
  <li>
    <p><strong>Cuarta Generaci&oacute;n (D&eacute;cada de 2000)</strong>: Los discos duros se hicieron m&aacute;s asequibles y empezaron a integrarse en la mayor&iacute;a de las computadoras personales. Se introdujeron interfaces m&aacute;s r&aacute;pidas como SATA, lo que permiti&oacute; velocidades de transferencia de datos m&aacute;s altas.</p>
  </li>
  <li>
    <p><strong>Quinta Generaci&oacute;n (D&eacute;cada de 2010 - Presente)</strong>: Los discos duros de estado s&oacute;lido (SSD) ganaron popularidad debido a su mayor velocidad y durabilidad en comparaci&oacute;n con los discos duros tradicionales. Los discos h&iacute;bridos (HDD + SSD) tambi&eacute;n se volvieron comunes, combinando la capacidad de almacenamiento de los discos duros con la velocidad de los SSD.</p>
  </li>
</ol>
</body>
</html>
